In [5]:
import pandas as pd
import numpy as np
from pydataset import data

np.random.seed(123)

In [6]:
#3
from env import host, user, password
def get_db_url(host, user, password, database):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

In [7]:

#4
employees_url = get_db_url(host, user, password, "employees")
print(employees_url)

mysql+pymysql://germain_1458:IQfrPWLifHbsrHeUglUuh2ZRWkZUdPww@157.230.209.171/employees

In [8]:
#5
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''
employees_female = pd.read_sql(sql, employees_url)
print(employees_female.head())

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [9]:
##Intentionally making a typo in the database name
#employees_female = pd.read_sql(sql, employee_url)
#print(employees_female.head())
##Returns the error unable to recognize the employee_url

#Intentionally making a typo for the sql query 
#sql = '''
#SELECT
    #emp_no,
    #first_name,
    #last_name
#FROM employee
#WHERE gender = 'F'
#LIMIT 100
#'''
#employees_female = pd.read_sql(sql, employees_url)
#print(employees_female.head())
##Returns the error programming error

In [10]:
#6
sql1 = '''
SHOW TABLES 
'''
tables = pd.read_sql(sql1, employees_url)
print(tables)

sql1 = '''
SELECT * 
FROM employees
'''
employees = pd.read_sql(sql1, employees_url)
sql2 = '''
SELECT * 
FROM titles
'''
titles = pd.read_sql(sql2, employees_url)

    Tables_in_employees
0      current_dept_emp
1           departments
2              dept_emp
3  dept_emp_latest_date
4          dept_manager
5             employees
6              salaries
7                titles

In [11]:
#7
print("The employees table has", employees.shape[0], "rows and", employees.shape[1], "columns. The titles table has", titles.shape[0], "rows and", titles.shape[1], "columns.")
#Yes this is the result that I would have expected.

The employees table has 300024 rows and 6 columns. The titles table has 443308 rows and 4 columns.

In [12]:

#8
print("The summary statistics for the employees tables is: \n", employees.info(), employees.describe(), "\n The summary statistics for the titles table is: \n", titles.info(), titles.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB
The summary statistics for the employees tables is:
 None               emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000
 The summary statistics for the titles table is:
 None               emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [13]:
#9
titles_columns = '''
DESCRIBE titles
'''
employees_columns = '''
DESCRIBE employees
'''

print(pd.read_sql(titles_columns, employees_url))

print(pd.read_sql(employees_columns, employees_url))

unique_titles = '''
SELECT DISTINCT title
FROM titles
'''
unique = pd.read_sql(unique_titles, employees_url)
distinct_titles = titles.title.value_counts()
print("There are", len(distinct_titles), "unique titles in the titles table.")

       Field         Type Null  Key Default Extra
0     emp_no          int   NO  PRI    None
1      title  varchar(50)   NO  PRI    None
2  from_date         date   NO  PRI    None
3    to_date         date  YES         None
        Field           Type Null  Key Default Extra
0      emp_no            int   NO  PRI    None
1  birth_date           date   NO         None
2  first_name    varchar(14)   NO         None
3   last_name    varchar(16)   NO         None
4      gender  enum('M','F')   NO         None
5   hire_date           date   NO         None
There are 7 unique titles in the titles table.

In [14]:
#10
oldest_to_date = '''
SELECT to_date
FROM titles 
ORDER BY to_date ASC
LIMIT 1
'''
oldest = pd.read_sql(oldest_to_date, employees_url)

old_title = titles.sort_values(by = 'to_date').head(1)
print(old_title.to_date)

16064    1985-03-01
Name: to_date, dtype: object

In [ ]:
#11
newest_to_date = '''
SELECT to_date
FROM titles 
WHERE to_date != '9999-01-01'
ORDER BY to_date DESC
LIMIT 1
'''
newest_dates = pd.read_sql(newest_to_date, employees_url)
corrected_dates = titles[titles.to_date < pd.to_datetime('2022-01-01')]
new_title = corrected_dates.sort_values(by = 'to_date').tail(1)
print(new_title.to_date)

In [17]:

##Part 2
#1
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

print(users)

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

print(roles)

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN
   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [ ]:
#2
right_join_df =  users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)
print("Right join: \n")
print(right_join_df)

In [ ]:
#3
outer_join_df = users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
print("Outer join: \n")
print(outer_join_df)

In [27]:
users = users.drop(columns=['role_id'])
merged_df = users.merge(roles)
print(merged_df)
#There is an error because there is nothing for the tables to connect on.

KeyError: "['role_id'] not found in axis"

In [65]:
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [22]:
#6 and 7
mpg.info()
#There are 234 rows and 11 columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

(234, 11)

In [66]:
dict = {'displ': 'displacement',
        'cyl': 'cylinder',
        'cty': 'city', 
        'hwy': 'highway'}
mpg.rename(columns=dict,
          inplace=True)
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class
1       29  p  compact
2       29  p  compact
3       31  p  compact
4       30  p  compact
5       26  p  compact

In [39]:
#9
print(mpg.describe())

          display         year    cylinder        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000
<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   display       234 non-null    float64
 3   year          234 non-null    int64
 4   cylinder      234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [68]:
#10
distinct_manufacturers = mpg.manufacturer.value_counts()
print("There are", len(distinct_manufacturers), "different manufacturers.")

There are 15 different manufacturers.

In [69]:
distinct_models = mpg.model.value_counts()
print("There are", len(distinct_models), "different models.")

There are 38 different models.

In [70]:
mpg['mileage difference'] = mpg['highway'] - mpg['city']
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference
1       29  p  compact                  11
2       29  p  compact                   8
3       31  p  compact                  11
4       30  p  compact                   9
5       26  p  compact                  10

In [72]:
mpg['average_mileage'] = (mpg['highway'] + mpg['city'])/2
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference  average_mileage
1       29  p  compact                  11             23.5
2       29  p  compact                   8             25.0
3       31  p  compact                  11             25.5
4       30  p  compact                   9             25.5
5       26  p  compact                  10             21.0

In [98]:
boolean = mpg['trans'].str.contains('auto')
mpg['is_automatic'] = np.where(mpg['trans'].str.contains('auto'), 'Automatic', 'Not Automatic')
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference  average_mileage   is_automatic
1       29  p  compact                  11             23.5      Automatic
2       29  p  compact                   8             25.0  Not Automatic
3       31  p  compact                  11             25.5  Not Automatic
4       30  p  compact                   9             25.5      Automatic
5       26  p  compact                  10             21.0      Automatic

In [96]:
maximum_manufacturer = mpg.groupby('manufacturer').average_mileage.agg(['mean']).idxmax()[0]
maximum_mileage = mpg.groupby('manufacturer').average_mileage.agg(['mean']).max()[0]
print("The manufacturer with the best average mileage is", maximum_manufacturer, "with an average mileage of", maximum_mileage)

The manufacturer with the best average mileage is honda with an average mileage of 28.5

In [103]:
better_car = mpg.groupby('is_automatic').average_mileage.agg(['mean', 'median']).idxmax()[0]
better_mean = round(mpg.groupby('is_automatic').average_mileage.agg(['mean']).max()[0], 2)
better_median = mpg.groupby('is_automatic').average_mileage.agg(['median']).max()[0]
print(better_car, "cars have better mileage, with an average mileage of", better_mean, "an a median mileage of", better_median)

Not Automatic cars have better mileage, with an average mileage of 22.23 an a median mileage of 22.0